aerate
age
bake
barbecue
baste
batter
beat
bind
blacken
blanche
blend
boil
bone
braise
bread
brew
broil
brown
brush
burn
butterfly
can
caramelize
char
chill
chop
chunk
churn
clarify
coddle
combine
cool
congeal
core
cream
cured
cut
debone
decorate
deglaze
descale
devil
dice
dip
dough
drain
drizzle
dry
escallop
ferment
fillet
filter
flambe
flavor
flip
fold
freeze
fricassee
frost
froth
fry
garnish
gel
glaze
grate
gratin
grease
grill
grind
harden
hash
heat
hull
ice
infuse
jell
juice
julienne
knead
layer
leaven
macerate
marinate
mash
measure
melt
microwave
mix
mold
oil
overcook
parboil
pare
peel
percolate
pickle
pit
poach
pop
pour
precook
prepare
preserve
press
process
pulp
puree
quarter
raw
reduce
refrigerate
render
rise
roast
roll
rub
salt
saute
scald
scallop
schirr
scoop
score
scramble
sear
season
separate
serve
shell
shred
shuck
sieve
sift
simmer
skewer
skim
skin
slice
sliver
smoke
snip
soak
souse
sprinkle
steam
steep
stew
stir
strain
stuff
sweat
sweeten
temper
tenderize
thicken
thin
toast
top
toss
trim
truss
turn
uncured
unmold
warm
wash
wedge
whip
whisk
zap
zest
afford
atm
auction
bailout
balance
bank
bankrupt
bankruptcy
bargain
bill
bonds
borrow
bought
budget
business
buy
capital
cash
cent
change
cheap
check
collateral
commodity
compound
coupon
credit
currency
debt
defecit
deposit
depression
dime
discount
diversify
dividend
dollar
donate
donation
donor
earn
earnings
economy
economics
economist
equity
estate
euro
exchange
expense
expensive
finance
financier
fund
income
interest
invest
investment
investor
lend
lender
loan
loss
margin
market
money
mortgage
nickel
note
outgo
overdrawn
pay
payment
pence
penny
percentage
poor
portfolio
pound
profit
purse
quarter
rate
rebate
receipt
recession
rent
reserve
rich
risk
sale
save
savings
security
sell
seller
sold
spend
stocks
surplus
swap
tax
teller
thrifty
trade
treasury
value
vault
wallet
wealth
withdraw
yield
astrophysics
astronomy
atom
beaker
biochemistry
biology
botany
burette
cell
chemical
chemistry
climate
climatologist
control
cuvette
data
datum
electricity
electrochemist
element
energy
entomology
evolution
experiment
fact
flask
fossil
funnel
genetics
geology
geophysics
glassware
gravity
herpetology
hypothesis
ichthyology
immunology
lab
laboratory
laws
lepidoptery
magnetism
mass
matter
measure
meteorologist
meteorology
microbiologist
microbiology
microscope
mineral
mineralogy
molecule
motion
observe
observatory
organism
ornithology
paleontology
particle
phase
physics
pipette
quantum
mechanics
radiology
research
retort
scale
science
scientist
seismology
telescope
temperature
test
tube
theory
thermometer
tissue
variable
virologist
volcanology
volume
volumetric
flask
watch
glass
weather
weigh
zoology
aerobics
archer
archery
arena
arrow
athlete
athletics
axel
badminton
ball
base
baseball
basketball
bat
baton
batter
batting
biathlon
bicycle
bicycling
bike
biking
billiards
bobsleigh
bocce
boomerang
boules
bow
bowler
bowling
boxer
boxing
bronze
medal
bunt
canoe
canoeing
catch
catcher
champion
championship
cleats
club
coach
compete
competing
competition
competitor
crew
cricket
croquet
cross
country
cue
curling
cycle
cycling
cyclist
dart
dartboard
deadlifting
decathlon
defense
diamond
discus
dive
diver
diving
dodgeball
doubleheader
dugout
epee
equestrian
equipment
exercise
fencing
field
fielder
field
hockey
fielding
figure
skating
fitness
football
forward
free
throw
frisbee
game
gear
geocaching
go
goal
goalie
gold
medal
golf
golfer
golfing
guard
gym
gymnast
gymnastics
gymnasium
halftime
hammer
throw
handball
hang
gliding
hardball
helmet
heptathlon
high
jump
hitter
hockey
home
home
plate
run
team
hoop
horseshoes
huddle
hurdle
ice
hockey
rink
skates
skating
infield
infielder
inning
javelin
jog
jogger
judo
jump
jumper
jumping
karate
kayak
kayaker
kayaking
kickball
kneepads
kite
lacrosse
league
lose
loser
luge
lutz
major
league
mallet
martial
arts
mma
mat
medal
minor
league
mitt
mouthguard
move
movement
mvp
net
skiing
offense
ollie
olympics
orienteering
out
outfield
outfielder
paddle
paddleball
paddling
paintball
parasailing
parkour
pentathlon
pickleball
ping
pong
pitch
pitcher
play
player
playing
playoffs
pole
vault
polo
pool
puck
quarter
quarterback
quiver
race
racer
racewalking
racing
racket
racquetball
rafting
referee
relay
ride
riding
rink
rock
climbing
row
rower
rowing
rugby
run
runner
running
sailing
score
scoreboard
scuba
scull
sculling
shortstop
silver
skate
rink
skeleton
ski
skier
skiing
slalom
sled
sledder
sledding
snorkling
snowboard
snowboarder
snowboarding
snowshoeing
soccer
softball
somersault
speed
sport
sportsmanship
squash
stadium
stick
strike
stroke
sumo
wrestling
surfer
surfing
swim
swimmer
swimming
synchronized
tennis
taekwondo
tag
target
team
teammate
tee
tennis
tetherball
throw
throwing
tie
toboggan
track
trampoline
triathlon
triathlete
triple
marathon
ultramarathon
ultramarathoner
umpire
unicycle
unicyclist
uniform
vault
vaulter
vaulting
visiting
volley
wakeboarding
walk
walker
walking
waterski
waterskier
waterskiing
weightlifter
weightlifting
weights
wetsuit
wicket
win
windsurfer
windsurfing
winner
winning
cup
series
wrestler
wrestling
accelerator
airbag
air
conditioner
conditioning
filter
vent
alarm
all
wheel
drive
alternator
antenna
anti
lock
brakes
armrest
auto
automatic
transmission
automobile
axle
car
seat
baby
seat
back
up
lights
battery
bonnet
brake
light
brake
pedal
brakes
bucket
bumper
camshaft
car
carburetor
catalytic
converter
chassis
chrome
trim
clutch
computer
console
cooling
system
crankshaft
cruise
control
cylinder
dashboard
defroster
diesel
engine
dip
stick
differential
door
handle
belt
shaft
drivers
emergency
brake
emergency
lights
emissions
engine
block
exhaust
pipe
exhaust
system
fan
belt
fender
filter
floor
mat
fog
light
four
wheel
frame
fuel
cap
gauge
fuse
gas
gasket
pedal
gauge
gasoline
tank
gauge
gearbox
gear
shift
gear
stick
glove
compartment
gps
grille
hand
brake
headlamp
headlight
headrest
heater
beam
headlights
hood
horn
hubcap
hybrid
ignition
instrument
panel
interior
light
internal
combustion
engine
jack
key
license
plate
lights
lock
lug
bolt
lug
nut
manifold
manual
transmission
mat
mirror
moon
roof
motor
mud
flap
muffler
navigation
system
odometer
oil
oil
filter
oil
tank
parking
brake
parking
lights
passenger
seat
pedal
piston
power
brakes
power
steering
power
window
switch
radiator
radio
rag
top
rear
view
mirror
rear
window
defroster
reverse
light
rims
roof
roof
rack
rotary
engine
seat
seat
belt
shift
shock
absorber
side
airbags
side
mirror
spare
tire
spark
plug
speaker
speedometer
spoiler
starter
steering
column
steering
wheel
sunroof
sun
visor
suspension
tachometer
tailgate
temperature
gauge
thermometer
tire
trailer
hitch
transmission
trim
trip
computer
trunk
turbo
charger
turn
signal
undercarriage
unleaded
gas
valve
vents
visor
warning
light
wheel
wheel
well
window
windshield
windshield
wiper
abscess
ache
acute
ailing
ailment
allergy
ambulance
antibiotic
appointment
artery
bacteria
bandage
benign
biopsy
birth
bleed
blister
blood
blood
pressure
blood
type
blurred
vision
bone
braces
breathe
breathing
broken
bone
bruise
burn
cancer
care
cartilage
cast
cavity
chart
chills
chronic
circulatory
clinic
clot
coma
concussion
contagious
contusion
cough
culture
cut
cyst
death
deficiency
delivery
dentist
dental
dentures
diabetes
diagnose
diagnosis
diarrhea
diet
digestive
disease
disinfect
disorder
doctor
dose
dosage
dose
drug
emergency
room
exam
examination
eye
test
faint
fever
filling
first
aid
flu
fracture
gland
growth
headache
heal
health
healthy
hearing
test
heart
heartbeat
height
hygienist
hypodermic
needle
ill
illness
immune
system
immunization
infection
inflammation
injury
inoculation
intensive
care
jaundice
jaw
joints
kidney
laparoscope
laryngitis
lotion
lungs
malignant
medic
medical
medication
medicine
minerals
mucus
muscle
needle
nerves
nurse
nutrition
ointment
operate
operation
opthalmologist
optometrist
orderly
pain
painful
pediatrician
physical
therapy
physician
pill
placebo
plasma
pneumonia
poison
practitioner
prescription
pressure
procedure
pulse
pus
quarantine
rash
reaction
recover
recovery
reflex
respiratory
system
runny
nose
scab
scale
scalpel
scan
opinion
seizure
shock
shot
sick
sickness
skeleton
skull
sling
sore
specialist
spinal
splinter
sprain
sterilized
sting
stitches
stomach
ache
stretcher
surgery
survive
swab
swollen
symptom
syndrome
temperature
tendon
test
therapy
therapeutic
toxic
transfusion
treat
treatment
tumor
tweezers
ultrasound
urine
vaccination
vaccine
vector
vein
venom
virus
vitamins
vomit
wart
weight
weakness
wheezing
wound
x
ray
